app/views/book/detail.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <h2>投稿者
      <%= User.find_by(id: @notice.sender).email %></h2>