app/views/book/notice.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
          <td><%= link_to notice.title, "/notice/#{notice.id}" %></td>
          <td><%= User.find_by(id: notice.sender).email %></td>