app/controllers/book_controller.rb

  def index
    @books = Book.page(params[:page]).per(3)
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "books"

  def notice
    @notices = Notice.where(read: false)
---
SELECT "notices".* FROM "notices" WHERE "notices"."read" = ?  [["read", "f"]]

  def detail
    @notice = Notice.find_by(id: params[:id])
---
SELECT  "notices".* FROM "notices" WHERE "notices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def read
    @notice = Notice.find_by(id: params[:id])
    @notice.read = true
    @notice.save
---
SELECT  "notices".* FROM "notices" WHERE "notices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "notices" SET "read" = ?, "updated_at" = ? WHERE "notices"."id" = ?  [["read", "t"], ["updated_at", "2018-03-05 06:38:04.665454"], ["id", 1]]

  def search
    search = params[:search]
    @books = Book.where("title like '%"+ search + "%' ").or(
    Book.where("author like '%"+ search + "%' ")).or(
    Book.where("publisher like '%"+ search + "%' ")).or(
    Book.where("genre like '%"+ search + "%' "))
---
SELECT "books".* FROM "books" WHERE ((("books"."title" = ? OR "books"."author" = ?) OR "books"."publisher" = ?) OR "books"."genre" = ?)  [["title", "ラブライブ"], ["author", "ラブライブ"], ["publisher", "ラブライブ"], ["genre", "ラブライブ"]]

  def show
    if @book = Book.find_by(id: params[:id]) != nil
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def rental
    @book = Book.find_by(id: params[:id])
    @book.status = false
    @book.rental_user = current_user.email
    if @book.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "status" = ?, "rental_user" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["status", "f"], ["rental_user", "#<User:0x00007facaf292bc0>"], ["updated_at", "2018-03-03 06:29:21.364837"], ["id", 1]]

  def return
    @book = Book.find_by(id: params[:id])
    @book.status = true
    @book.rental_user = nil
    if @book.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "status" = ?, "rental_user" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["status", "t"], ["rental_user", nil], ["updated_at", "2018-03-03 07:34:35.761178"], ["id", 2]]

  def url
      type = "購入申請"
      @notice = Notice.new(
        title: type,
        body: params[:amazonurl],
        sender: current_user.id,
        read: false
      )
    if @notice.save
---
INSERT INTO "notices" ("title", "body", "sender", "read", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "購入申請"], ["body", "https://amazon/books/lib"], ["sender", 1], ["read", "f"], ["created_at", "2018-03-05 05:10:10.404225"], ["updated_at", "2018-03-05 05:10:10.404225"]]

  def demand
    type = "問い合わせ"
    @notice = Notice.new(
      title: type,
      body: params[:body],
      sender: current_user.id,
      read: false
    )
    if @notice.save
---
INSERT INTO "notices" ("body", "sender", "read", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "あdsfじゃsフォイアshフォイアw；jfピアwj"], ["sender", 4], ["read", "f"], ["created_at", "2018-03-05 13:30:24.452312"], ["updated_at", "2018-03-05 13:30:24.452312"]]

  def user
    @books = Book.where(rental_user: current_user.email)
---
SELECT "books".* FROM "books" WHERE "books"."rental_user" = ?  [["rental_user", "skymars0327@yahoo.co.jp"]]